<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><!--This page is automatically generated.  Do not edit!-->
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Nutch: faq</title>
<style type="text/css">
.menuTd {background-color: #F9F7F4; height: 25; onMouseOver: this.style.backgroundColor='#ECE5DC';}
.menuTdhover {background-color: #ECE5DC; height: 25; onMouseOver: this.style.backgroundColor='#ECE5DC';}
.menuEntry {  font-family: Arial, Helvetica, sans-serif; font-size: 12px; color: #000000; text-decoration: none}
.body {background-color: #F9F7F4;}
.bodytext {  font-family: Arial, Helvetica, sans-serif; font-size: 12px; color: #000000; text-decoration: none}
.title {  font-family: Arial, Helvetica, sans-serif; font-size: 26px; color: #FF9900; text-decoration: none}
.intro {  font-family: Arial, Helvetica, sans-serif; font-size: 12px; color: #FF9900; text-decoration: none}
.orangeTd {background-color: #FF9900}
ul {list-style-image: url(../img/reiter/ul.gif)}
h3 {font-family: Arial, Helvetica, sans-serif; font-size: 16px; color: #000000;}
h4 {font-family: Arial, Helvetica, sans-serif; font-size: 14px; color: #000000;}
.url {color: #996600;}
</style>
<link type="image/x-icon" href="../img/favicon.ico" rel="icon">
<link type="image/x-icon" href="../img/favicon.ico" rel="shortcut icon">
</head>
<body>
<!--This file is automatically generated.  Do not edit!-->
<table cellspacing="0" cellpadding="0" border="0" width="635">
<tr>
<td rowspan="2" width="140" valign="bottom"><a href="./"><img border="0" src="../img/reiter/logo_nutch.gif"></a><img height="1" width="140" src="../img/reiter/spacer_666666.gif"></td>
</tr>
<tr>
<td align="right" valign="bottom" width="495">
<table width="495" cellspacing="0" cellpadding="0" border="0">
<tr>
<td width="400" background="../img/reiter/_bg_reiter.gif">&nbsp;</td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_le1.gif"></td><td nowrap="nowrap" valign="bottom" background="../img/reiter/_bg_reiter_inactive.gif"><a href="about.html" class="bodytext">Quan a</a></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_ri.gif"></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_le.gif"></td><td nowrap="nowrap" valign="bottom" background="../img/reiter/_bg_reiter_inactive.gif"><a href="faq.html" class="bodytext">FAQ</a></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_ri.gif"></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_le.gif"></td><td nowrap="nowrap" valign="bottom" background="../img/reiter/_bg_reiter_inactive.gif"><a href="developers.html" class="bodytext">Desenvolupadors</a></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_ri.gif"></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_le.gif"></td><td nowrap="nowrap" valign="bottom" background="../img/reiter/_bg_reiter_inactive.gif"><a href="../en/donate.html" class="bodytext">D&oacute;na</a></td><td width="10" valign="bottom" height="28"><img border="0" src="../img/reiter/reiter_inactive_ri.gif"></td>
</tr>
</table>
</td>
</tr>
</table>
<table cellspacing="0" cellpadding="0" border="0" width="635">
<tr valign="top">
<td width="140">
<table cellspacing="0" cellpadding="0" width="100%">
<tr>
<td>&#160;</td>
</tr>
</table>
</td><td background="../img/reiter/_spacer_cccccc.gif" width="20">&#160;</td><td class="body" width="475">
<table cellspacing="0" cellpadding="0" border="0" width="475">
<tr>
<td valign="bottom" width="275" height="125" class="title">faq</td><td valign="bottom" width="200" height="125"><img src="../img/reiter/robots.gif"></td>
</tr>
</table>
<br class="br">
<span class="bodytext">

	</span><span class="bodytext">
<h3>Per qu&egrave; necessitem el projecte Nutch, quan els cercadors s&oacute;n gratu&iuml;ts?</h3>
</span><span class="bodytext">

	</span><span class="bodytext">
<p>Els cercadors web s&oacute;n tan lliures d'emprar com la televisi&oacute; de mirar, per&ograve;, com la programaci&oacute; de televisi&oacute;, els resultats de cerca s&oacute;n objecte de manipulaci&oacute; interesada per part dels propietaris dels cercadors. L'&uacute;nica manera d'estar segurs que els resultats no s&oacute;n esbiaxats &eacute;s fent que la tecnologia que els produeix sigui p&uacute;blica. Nutch persegueix produir una tecnologia de cerca d'alta qualitat lliure i accessible.</p>
</span><span class="bodytext">
    
	</span><span class="bodytext">
<h3>Com puc ajudar?</h3>
</span><span class="bodytext">

	</span><span class="bodytext">
<p>Si estas interessat en fer una donaci&oacute; econ&ograve;mica, si us plau visita la nostra p&agrave;gina de <a href="../en/donate.html">donacions</a>.</p>
</span><span class="bodytext">

	</span><span class="bodytext">
<p>Si ets un desenvolupador, si us plau visita la nostra p&agrave;gina de <a href="developers.html">desenvolupadors</a>.</p>
</span><span class="bodytext">

	</span><span class="bodytext">
<p>Si tens qualsevol suggeriment, preguntes o comentaris, si us plau envia un missatge a <a href="mailto:general@nutch.org">general@nutch.org</a>.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Com pot una organitzaci&oacute; sense &agrave;nim de lucre permetre's muntar un motor de cerca al Web?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Nutch &eacute;s primordialment un projecte de programari, no un servei. Instal&middot;lacions a gran escala de Nutch seran segurament dutes a terme per iniciatives comercials que no tenen cap lligam amb Nutch, financiant-ho mitjan&ccedil;ant publicitat o d'altres. Si el programari Nutch &eacute;s prou b&oacute;, podria ser que els grans motors de cerca actuals acabessin usant-lo enlloc del seu codi tancat actual.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<p>El projecte Nutch mateix, podria hostatjar una demo a petita escala del sistema, de manera que la gent pugui comprovar que realment funciona. Aix&ograve; requeriria una quantitat de diners moderada, potser d'alguns centenars de milers de dolars. El projecte Nutch potser mai arribar&agrave; a hostatjar una instal&middot;laci&oacute; a gran escala perqu&egrave; els usuaris puguin fer-lo servir de forma di&agrave;ria i habitual. Aix&ograve; ho deixarem en mans de les iniciatives comercials que s'ho puguin permetre.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Arribar&agrave; algun dia en qu&egrave; Nutch sigui tant bo com els altres cercadors Web?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Nosaltres esperem que sigui fins i tot millor. Amb desenvolupadors i investigadors de tots els racons del m&oacute;n ajudant i col&middot;laborant amb el projecte, nosaltres esperem ser capa&ccedil;os de superar la qualitat del qu&egrave; una sola companyia pot fer.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Com puc evitar que Nutch entri al meu lloc Web?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Si us plau, visita la nostra <a href="../en/bot.html">p&agrave;gina d'informaci&oacute; per a webmasters</a>.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Com em puc asegurar que Nutch entri al meu lloc Web?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Nutch fa servir el <a href="http://www.dmoz.org/">DMOZ Directori Obert</a> per subministrar llocs Web al crawler. La millor manera d'assegurar-te que el teu lloc Web &eacute;s indexat per Nutch &eacute;s comprovant que aparegui llistat al Directori Obert.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Ser&agrave; Nutch un cercador distribuit, basat en tecnologies P2P?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>No pensem que sigui possible, de moment, construir un motor de cerca web distribuit que sigui competitiu amb els altres motors de cerca exitents al mercat. Seria massa lent. Retornar els resultats en menys d'un segon &eacute;s molt important: aix&ograve; permet a l'usuari reformular r&agrave;pidament les seves consultes de manera que puguin trobar el que busquen d'una forma m&eacute;s frequent i eficient. Resumint, un cercador r&agrave;pid &eacute;s un cercador millor. No creiem que gaire gent vulgui emprar un cercador que trigi m&eacute;s de deu segons o m&eacute;s per retornar els resultats.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Dit aix&ograve;, si alg&uacute; vol iniciar algun subprojecte de Nutch per explorar el tema de la cerca distribuida, nosaltres estarem encantats d'hostatjar-lo. No creiem que aquest tipus de t&eacute;cniques puguin arribar a resoldre els dif&iacute;cils problemes que Nutch necessita solventar, per&ograve; estarem encantats de veure provar que realment no s&oacute;n la soluci&oacute; adecuada.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Far&agrave; servir Nutch un crawler distribu&iuml;t com <a href="http://www.grub.org/">Grub</a>?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>El crawling distribu&iuml;t pot estalviar amplada de banda, per&ograve;, a la llarga, aquest estalvi no &eacute;s significant. Un motor de cerca exit&oacute;s requereix m&eacute;s amplada de banda per pujar els resultats de cerca que els que necessita el crawler per baixar-se les p&agrave;gines, d'aquesta manera, fer que el crawler empri menys amplada de banda no redueix les necessitats globals d'amplada de banda. El que consumeix m&eacute;s recursos en un cercador web no &eacute;s el proc&eacute;s de crawling (recol&middot;lecci&oacute; de p&agrave;gines) sin&oacute; el de cerca..</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>El fet que el codi sigui obert, no facilitar&aacute; que d'altres llocs Web manipulin els r&agrave;nquings?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Dins del m&oacute;n del desenvolupament de motors de cerca Web es treballa dur per contruir algoritmes de r&agrave;nquing que siguin inmunes a la manipulaci&oacute;. Alguns optimitzadors de cerca al Web encara aconsegueixen d'interpretar, mitjan&ccedil;ant enginyeria inversa, els algoritmes de r&agrave;nquing emprats pels cercadors Web, i millorar la posici&oacute; al r&agrave;nquing de les seves p&agrave;gines. Per exemple, molts lloc Web fan servir 'granjes d'enlla&ccedil;os' per manipular els algoritmes de r&agrave;nquing basats en enlla&ccedil;os. Els cercadors Web, al seu torn, repliquen millorant els seu algoritmes perqu&egrave; no tinguin en compte els efectes generats per les 'granjes d'enlla&ccedil;os'.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Amb un motor de cerca de codi obert, aix&ograve; encara passar&agrave;, com a la resta de cercadors. El problema &eacute;s semblant al de l'encriptaci&oacute; i el programari de protecci&oacute; de virus. A llarg termini, fer que els algoritmes siguin oberts, els far&agrave; m&eacute;s forts, a mesura que m&eacute;s i m&eacute;s gent pugui examinar el codi font per detectar punt febles i suggerir millores. Per tant, nosaltres creiem que un motor de cerca fet amb codi obert t&eacute; el potencial per a resistir millor els intents de manipulaci&oacute; dels r&agrave;nkings.</p>
</span><span class="bodytext">

</span><span class="bodytext">
<h3>Quan buscar&agrave; Nutch imatges, fitxers pdf, etc.?</h3>
</span><span class="bodytext">

</span><span class="bodytext">
<p>Aviat, esprem.</p>
</span><span class="bodytext">

</span>
<br class="br">
<br class="br">
</td>
</tr>
</table>
<table width="635" border="0" cellpadding="0" cellspacing="0">
  
<tr>
    
<td width="140">&nbsp;</td>
    <td width="20">&nbsp;</td>
    <td width="475" align="center">
    <span class="bodytext">
    <a href="http://creativecommons.org/licenses/by/2.0/" rel="license">
      <img src="http://creativecommons.org/images/public/somerights.gif" width="88" height="31" alt="Creative Commons License" border="0">
    </a>
    
<br>
    Except where otherwise noted, <br>this site is licensed under a <a href="http://creativecommons.org/licenses/by/2.0/">Creative Commons
    License</a>.
    <br>
      
<a href="../ca/">ca</a> |
      <a href="../de/">de</a> |
      <a href="../en/">en</a> |
      <a href="../es/">es</a> |
      <a href="../fi/">fi</a> |
      <a href="../fr/">fr</a> |
      <a href="../hu/">hu</a> |
      <a href="../jp/">jp</a> |
      <a href="../ms/">ms</a> |
      <a href="../nl/">nl</a> |
      <a href="../pl/">pl</a> |
      <a href="../pt/">pt</a> |
      <a href="../sv/">sv</a> |
      <a href="../th/">th</a> |
      <a href="../zh/">zh</a>
    
<br>
    
<a href="http://sourceforge.net"><img src="http://sourceforge.net/sflogo.php?group_id=59548" alt="sf.net" width="0" height="0" border="0"></a>
    </span>
    </td>
  
</tr>
  
<tr>
  
</tr>

</table>
</body>
</html>
